app/controllers/followers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
	def random
		render json: User.where(["id != ?", current_user.id])
			    .order("random()").all

INSERT INTO "followers" ("user_id", "followed_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["followed_by", 3], ["created_at", "2015-12-21 04:14:39.529117"], ["updated_at", "2015-12-21 04:14:39.529117"]]
---
	def create
		follower = Follwer.create(user_id: params[:user_id],
					  followed_by: current_user.id)