app/controllers/profile_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Joe"], ["last_name", "Shmo"], ["updated_at", "2015-12-13 22:10:45.348497"], ["id", 1]]
---
	def update
		current_user.update(user_params)