app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"  ORDER BY "tweets"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
---
	def index
		render json: Tweet.includes(:user).all

INSERT INTO "tweets" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Twitter Post"], ["user_id", 1], ["created_at", "2015-12-13 22:51:00.750415"], ["updated_at", "2015-12-13 22:51:00.750415"]]
---
	def create
		tweet = Tweet.create(body: params[:body], user_id: current_user.id)